IDENTIFICATION DIVISION.
PROGRAM-ID. MATH.

DATA DIVISION.
WORKING-STORAGE SECTION.
01  NUM1            PIC 9(4).
01  NUM2            PIC 9(4).
01  RESULT          PIC 9(5).

PROCEDURE DIVISION.
MAIN-LOGIC.
    DISPLAY "Enter first number: ".
    ACCEPT NUM1.
    DISPLAY "Enter second number: ".
    ACCEPT NUM2.
    ADD NUM1, NUM2 GIVING RESULT.
    DISPLAY "Sum is: " RESULT.
    SUBTRACT NUM2 FROM NUM1 GIVING RESULT.
    DISPLAY "Difference is: " RESULT.
    MULTIPLY NUM1 BY NUM2 GIVING RESULT.
    DISPLAY "Product is: " RESULT.
    DIVIDE NUM1 BY NUM2 GIVING RESULT.
    DISPLAY "Quotient is: " RESULT.
    STOP RUN.
