IDENTIFICATION DIVISION.
PROGRAM-ID. MY-PROGRAM.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 I PIC 9(2) VALUE 1.
01 J PIC 9(2) VALUE 1.

PROCEDURE DIVISION.
MAIN-PROCEDURE.
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > 10
        PERFORM VARYING J FROM 1 BY 1 UNTIL J > 10
            DISPLAY "I = " I ", J = " J
        END-PERFORM
    END-PERFORM
    STOP RUN.
